<script setup lang="ts">
definePageMeta({
  title: "pages.privacy.title",
  backgroundImage: "/header.jpg",
});

const { t } = useI18n();

useSeoMeta({
  title: t('seo.titles.privacy'),
});
</script>

<template>
  <p class="text-container">
    <b>ПОЛИТИКА В ОТНОШЕНИИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</b><br />
    <br />
    1. Общие положения Настоящая политика обработки персональных данных составлена в соответствии с
    требованиями Федерального закона от 27.07.2006. № 152-ФЗ «О персональных данных» (далее — Закон
    о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению
    безопасности персональных данных, предпринимаемые гражданином Баядиновой Еленой Юрьевной (далее
    — Оператор).<br />
    <br />
    1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности
    соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том
    числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.<br />
    1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее — Политика)
    применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта
    <a href="https://ragdoll-bluebelldolls.ru">https://ragdoll-bluebelldolls.ru</a>.<br />
    <br />
    2. Основные понятия, используемые в Политике<br />
    2.1. Веб-сайт — совокупность графических и информационных материалов, а также программ для ЭВМ и
    баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу
    <a href="https://ragdoll-bluebelldolls.ru">https://ragdoll-bluebelldolls.ru</a>.<br />
    2.2. Пользователь — любой посетитель веб-сайта
    <a href="https://ragdoll-bluebelldolls.ru">https://ragdoll-bluebelldolls.ru</a>.<br />
    2.3. Персональные данные — любая информация, относящаяся прямо или косвенно к определенному или
    определяемому Пользователю веб-сайта.<br />
    <br />
    3. Оператор может обрабатывать следующие персональные данные Пользователя<br />
    - Имя.<br />
    - Номер телефона.<br />
    <br />
    4. Цели обработки персональных данных<br />
    4.1. Цель обработки персональных данных Пользователя (Имя, Телефон):<br />
    - Информирование Пользователя посредством отправки сообщений в мессенджеры или звонков.<br />
    - Уточнение деталей бронирования котят.<br />
    - Консультация по услугам питомника.<br />
    <br />
    5. Правовые основания обработки персональных данных<br />
    5.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или
    отправки Пользователем самостоятельно через специальные формы, расположенные на сайте
    <a href="https://ragdoll-bluebelldolls.ru">https://ragdoll-bluebelldolls.ru</a>. Заполняя
    соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает
    свое согласие с данной Политикой.<br />
    <br />
    6. Порядок сбора, хранения, передачи и других видов обработки персональных данных<br />
    6.1. Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем
    реализации правовых, организационных и технических мер, необходимых для выполнения в полном
    объеме требований действующего законодательства.<br />
    6.2. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры,
    исключающие доступ к персональным данным неуполномоченных лиц.<br />
    6.3. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим
    лицам, за исключением случаев, связанных с исполнением действующего законодательства.<br />
    <br />
    7. Заключительные положения<br />
    7.1. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных,
    направив Оператору уведомление посредством электронной почты на электронный адрес Оператора
    <a href="mailto:ragdoll-bluebelldolls@mail.ru">ragdoll-bluebelldolls@mail.ru</a> с пометкой
    «Отзыв согласия на обработку персональных данных».<br />
    7.2. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу
    <a href="https://ragdoll-bluebelldolls.ru/privacy">https://ragdoll-bluebelldolls.ru/privacy</a>.
  </p>
</template>

<style scoped>
.text-container {
  padding: var(--padding-pages);
  background-color: var(--color-pages-secondary-background);
  font-size: 1.25rem;
}
</style>
